// Project
#include "receipt.h"

QString receiptGet(QString tpl)
{
    QString receipt = QString();

    if (tpl == "tjk")
    {
        receipt = QString("[p]*************** [b]Хумо[/b] ***************\n\n"
                          "[p]Раками расид:    %1\n"
                          "[p]Раками терминал: %2\n"
                          "[p]Санаи пардохт:   [u]%3[/u]\n"
                          "[p]Терминали агент: %4\n"
                          "%5\n"

                          "[p]Провайдер:       [b]%6[/b]\n"
                          "[p]Ракам/Хисоб:     [b]%7[/b]\n"
                          "[p]Кабул шуд:       %8 сомони\n"
                          "[p]Пардохта шуд:    %9 сомони\n"
                          "[p]Хаки хизмат:     %10 сомони\n\n"

                          "[p]То ворид шудани маблаг,\n"
                          "[p]расидро нигох доред!\n"
                          "[p]----------------------------------------\n"
                          "[p] [b]Тамос: %11[/b]\n\n");
    }

    if (tpl == "uzb")
    {
        receipt = QString("[p]*************** [b]Орзу[/b] ***************\n\n"
                          "[p]Номер чека:    %1\n"
                          "[p]Номер терминала: %2\n"
                          "[p]Дата платежа:   [u]%3[/u]\n"
                          "[p]Агент: %4\n"
                          "%5\n"

                          "[p]Услуга:       [b]%6[/b]\n"
                          "[p]Номер/Счет:     [b]%7[/b]\n"
                          "[p]Принято:       %8 сум\n"
                          "[p]Оплачено:    %9 сум\n"
                          "[p]Комиссия:     %10 сум\n\n"

                          "[p]----------------------------------------\n"
                          "[p] [b]Call Center: %11[/b]\n\n");
    }

    return receipt;
}
