/* @file Основные типы данных, используемых в ФР. */

#pragma once

//--------------------------------------------------------------------------------
/// Режим работы ФР
namespace EFRMode {
enum Enum { Fiscal, Printer };
} // namespace EFRMode

//--------------------------------------------------------------------------------
/// Регион (для налоговых ставок).
namespace ERegion {
enum Enum { RF, KZ };
} // namespace ERegion

//--------------------------------------------------------------------------------
/// Типы ФР.
namespace EFRType {
enum Enum {
    EKLZ,   // Старый ФР с ЭКЛЗ
    NoEKLZ, // Старый ФР без ЭКЛЗ (для ЕНВД)
    FS      // Онлайновый ФР с ФН
};
} // namespace EFRType

//--------------------------------------------------------------------------------
/// Форматы ФФД.
namespace EFFD {
enum Enum {
    Unknown = -1, // Неизвестная
    F10Beta,      // 1.0 Beta
    F10,          // 1.0
    F105,         // 1.05
    F11           // 1.1
};
} // namespace EFFD

//--------------------------------------------------------------------------------
