/* @file Интерфейс приложения. */

#pragma once

#include <QtCore/QDir>
#include <QtCore/QSettings>
#include <QtGui/QImage>

#include <SDK/PaymentProcessor/Core/ICore.h>

class IServiceManager;
class ILog;

//---------------------------------------------------------------------------
class IApplication {
public:
    //---------------------------------------------------------------------------
    // Структура с информацией о приложении
    struct AppInfo {
        QString version;
        QString appName;
        QString configuration;
    };

    //---------------------------------------------------------------------------
    // Деструктор
    ~IApplication() {};

    //---------------------------------------------------------------------------
    // Возвращает ядро платежного процессора
    virtual SDK::PaymentProcessor::ICore *getCore() = 0;

    //---------------------------------------------------------------------------
    // Возвращает логгер приложения
    virtual ILog *getLog() const = 0;

    //---------------------------------------------------------------------------
    // Возвращает аргументы командной строки
    virtual QVariantMap getArguments() const = 0;

    //---------------------------------------------------------------------------
    // Возвращает настройки приложения
    virtual QSettings &getSettings() const = 0;

    //---------------------------------------------------------------------------
    // Возвращает информацию о приложении
    virtual AppInfo getAppInfo() const = 0;

    //---------------------------------------------------------------------------
    // Возвращает скриншоты приложения
    virtual QList<QImage> getScreenshot() = 0;

    //---------------------------------------------------------------------------
    // Возвращает путь к пользовательским данным
    virtual QString getUserDataPath() const = 0;

    //---------------------------------------------------------------------------
    // Возвращает путь к плагинам
    virtual QString getPluginPath() const = 0;

    //---------------------------------------------------------------------------
    // Возвращает путь к пользовательским плагинам
    virtual QString getUserPluginPath() const = 0;

    //---------------------------------------------------------------------------
    // Возвращает абсолютный путь из aPath
    static QString toAbsolutePath(const QString &aPath);

    //---------------------------------------------------------------------------
    // Возвращает текущую рабочую папку
    static QString getWorkingDirectory();
};

//---------------------------------------------------------------------------
