/* @file Строки используемые в файле конфигурации. */

#pragma once

// Qt
#include <Common/QtHeadersBegin.h>
#include <QtCore/QString>
#include <Common/QtHeadersEnd.h>

//---------------------------------------------------------------------------
namespace CSettings
{
    //---------------------------------------------------------------------------
    // Путь к плагинам
    const char PluginsPath[] = "common/plugins_path";

    //---------------------------------------------------------------------------
    // Путь к пользовательским данным
    const char UserDataPath[] = "common/user_data_path";

    //---------------------------------------------------------------------------
    // Путь к интерфейсу
    const char InterfacePath[] = "common/interface_path";

    //---------------------------------------------------------------------------
    // Путь к контенту
    const char ContentPath[] = "common/content_path";

    //---------------------------------------------------------------------------
    // Путь к рекламе
    const char AdPath[] = "common/ad_path";
} // namespace CSettings

//---------------------------------------------------------------------------
