/* @file Строки используемые в файле конфигурации. */

#pragma once

#include <QtCore/QString>

//---------------------------------------------------------------------------
namespace CSettings {
//---------------------------------------------------------------------------
// Путь к плагинам
extern const char PluginsPath[];

//---------------------------------------------------------------------------
// Путь к пользовательским данным
extern const char UserDataPath[];

//---------------------------------------------------------------------------
// Путь к интерфейсу
extern const char InterfacePath[];

//---------------------------------------------------------------------------
// Путь к контенту
extern const char ContentPath[];

//---------------------------------------------------------------------------
// Путь к рекламе
extern const char AdPath[];
} // namespace CSettings

//---------------------------------------------------------------------------
