/* @file Помощник для сна потока. */

#pragma once

//--------------------------------------------------------------------------------
#include <QtCore/QThread>

//--------------------------------------------------------------------------------
class SleepHelper : public QThread {
public:
    /// Использование статических методов сна из QThread.
    using QThread::msleep;
    using QThread::sleep;
    using QThread::usleep;
};

//---------------------------------------------------------------------------
